/**
 * boss 傳送
 * 2022/06/20 優化
 */

// [BOSS 名稱, BOSS 血量, BOSS 地圖]
var bossList = [
    ["殭屍蘑菇王", "35,000", 105070002],
    ["蜈蚣王", "40,000", 701010323],
    ["地獄巴洛古", "55,000", 105090900],
    ["達納托斯", "70,000", 220070400],
    ["通道守門人", "78,000", 220060400],
    ["藍蘑菇王", "200,000", 800010100],
    ["格瑞芬多", "3,700,000", 240020101],
    ["噴火龍", "3,700,000", 240020401],
    ["瘋狂喵Z客", "6,000,000", 103040400],
    ["巴洛古", "未知", 105100000],
    ["拉圖斯", "23,000,000", 220080000 ],
    ["海怒斯", "30,000,000", 230040420],
    ["天狗", "35,000,000", 800020130],
    ["六手邪神", "未知", 501030105],
    ["大姐頭", "未知", 801040003],
    ["天皇蟾蜍", "未知", 800040410],
    ["殘暴炎魔", "未知", 280030000],
    ["闇黑龍王", "未知", 240060200],
    ["皮卡啾", "未知", 270050000],
];

function start() {
  status = -1;
  action(1, 0, 0);
}

function action(mode, type, selection) {
  if (mode == -1) {
    cm.dispose();
  } else {
    if (status >= 0 && mode == 0) {
      cm.sendOk("反悔了再來吧！");
      cm.dispose();
      return;
    }
    if (mode == 1) {
      status++;
    } else {
      status--;
    }
    if (status == 0) {
        var msg = "#k我是BOSS傳送員，請選擇你的目的地： \r\n#L99#奧芙赫班的後院#r【每日限制一次，固定掉落#i4001456#】#k#l \r\n#L98#凡雷恩的聖殿#r【機率掉落高級飾品】#k#l";
        for (var i = 0; i < bossList.length; i++) {
            msg += "\r\n#L" + i + "#" + bossList[i][0] + "(HP#r" + bossList[i][1] + "#k)#l";
        }
      cm.sendSimple(msg);
    } else if (status == 1) {
        var target = (selection === 98 ? 999999995 : selection === 99 ? 999999994 : bossList[selection][2]);
        cm.warp(target, 0);
        cm.sendOk("我已經將你傳送到#r" + cm.getMap().getMapName() + "#n#k了。歡迎再次光臨！");
        cm.dispose();
    }
  }
}
